posts/declutter-the-way-of-working/index.org
#+BEGIN_COMMENT
.. title: Declutter the way of working
.. slug: declutter-the-way-of-working
.. date: 2019-09-12 18:25:23 UTC+03:00
.. tags:
.. category:
.. link:
.. description:
.. type: text

#+END_COMMENT


Like many other people I strive to be as productive I can. Being productive means two things for me:
- Getting the most out of my tools and
- Spending less time on useless things.

Getting the most of my tools is the reason I continuously invest in learning [[https://www.gnu.org/software/emacs/][Emacs]] (which has proven to have a great return of investment) and in learning [[http://visualstudioshortcuts.com/2017/][Visual Studio shortcuts.]] It was for the same reason I was happy like a kid with a chocolate bar when Visual Studio introduced the =Ctrl+Q= shortcut for the =Quick Launch= menu which allowed me to launch various utilities from Visual Studio without bothering to learn shortcuts that aren't often used and without spending time navigating through the menu items looking for the one I had in mind.

Spending less time on useless things means having a good workflow and /I was not happy with mine/. And my workflow was quite simple --- after getting to work, I would start my workstation, open Outlook and whatever instant messaging applications I needed to use, open Visual Studio, get lates sources from TFS, open required solutions and start coding. In between any of those steps I would make myself a cup of tea from which I would sip ocasionally while working. It took me some time to do all those required steps before being able to actually read, write or debug some piece of code and albeit in time I got ahold of more powerfull machines which loaded things faster, I wasn't happy with the sensation of /having to wait to start working/.

I started thinking on how to avoid waiting and I turned to the simplest solution for my problem --- for every application that I needed to start at the beginning of the day I would put a shortcut in the Windows startup folder. This way, after getting to work I needed to boot my computer, log in and go make the tea while the applications were loading automatically. I couldn't load /all/ the required applications that way --- most of the time I needed to run Visual Studio with elevated permisions which halted the load of other applications due to the UAC settings --- but I was happy to open all other applications automatically while making my tea and open Visual Studio manually.

Meanwhile I switched the workstation with a laptop and got the opportunity to work on a data science project at work, alongside the main project I'm assigned to. Having a laptop brings a great deal of flexibility and having a performant laptop with great battery life tends to make me want to work on it for /all/ my projects.

And that's when things started to get complicated workflow-wise. The two projects I work on at my job have different technology stacks (=C#= with =.net core= on the main project and =Python= with =Azure ML= for the data science one) which means different workflows but still using the same applications for communication and other secondary tasks. In my spare time --- early in the morning or late at night --- I work on personal projects and that's when I feel the most infuriated with the plethora of applications that are starting automatically but are totally useless at that moment and do nothing more than consume resources.

At some point I realized that the time I used to spend a while ago to open the applications I needed, I now waste on closing the applications which are configured to start automatically but are of no use to me. Then I remembered that a while ago I read a [[https://bash.im/quote/436725][story about russian DevOps engineer who would automate a task if it required more that 1.5 minutes of his time]] (the English version and implementations of the scripts are available on [[https://github.com/NARKOZ/hacker-scripts][GitHub]]). That story got me thinking:
#+begin_quote
Can I change which applications are loaded automatically based on the project I'm working?
#+end_quote
Unfortunately, the answer is *no*. That's because my laptop won't know on which project I'll be working next. But my schedule might give a hint: all week except Thursday, from 9:00 to 18:00 I work on the main project at my job, on Thursdays from 9:00 to 18:00 I work on a secondary project and outside business hours I work on my other projects.

Ok, and how do I use that information? Up untill now I used to place shortcuts in Windows startup folder but that doesn't do it for me anymore. The problem with placing shortcuts in Windows startup folder is that there's no way to specify /when/ to start the application --- it will start all the time.

So I had to look elsewhere for a solution. The next place I looked was Windows Task Scheduler which provides more options for starting a task but unfortunately the triggers of Task Scheduler are either too simple to encode the ranges from my schedule or too complicated to bother with.

Thinking of how to make this decision simple I turned to PowerShell. I created two scripts, in each of them testing the following conditions:
- Is current time between 9:00 and 18:00 and current day is a work day but not Thursday? If yes, then this means I'm at my job, working for the main project and thus:
  - The first script will:
    - navigate to the directory mapped to TFS project,
    - get latest version and
    - open the solution in Visual Studio.
  - The second script will load other work-related applications like Outlook, MS Teams etc.
- Is current day Thursday and time is between 9:00 and 18:00? If yes, then I'm at my job working on the data science project and:
  - The first script will open =Ubuntu bash= from =WSL=.
  - The second script will open the =Azure ML workspace= in a browser.

Each of these scripts is invoked by Windows Task Scheduler at logon; the only difference being that the first one is executed with elevated privileges. I still need to run Visual Studio as administrator and by running the script with highest privileges I don't get the UAC dialog anymore.

None of the aforementioned scripts do anything outside working hours --- in that period I choose on which project to work based on what I feel like doing (to keep me engaged after a day at work) and various other factors. But the fact that, in those late or early hours I don't need to close some pesky little applications that keep distracting me, makes me be happy again with my workflow.
